app/controllers/abouts_controller.rb

  def index
    @abouts = About.all
---
SELECT "abouts".* FROM "abouts"

  def create
    @about = About.new(name: "Default")

    respond_to do |format|
      if @about.save
---
INSERT INTO "abouts" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Default"], ["created_at", "2015-10-24 19:13:58.652685"], ["updated_at", "2015-10-24 19:13:58.652685"]]

  def update
    respond_to do |format|
      if @about.update(about_params)
---
UPDATE "abouts" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "updated_at" = $4 WHERE "abouts"."id" = $5  [["image_file_name", "14731822384_d35e37dba3_k.jpg"], ["image_file_size", 2197309], ["image_updated_at", "2015-10-24 19:12:49.426126"], ["updated_at", "2015-10-24 19:12:49.448650"], ["id", 2]]

  def destroy
    @about.destroy
---
DELETE FROM "abouts" WHERE "abouts"."id" = $1  [["id", 5]]

    def set_about
      @about = About.find(params[:id])
---
SELECT  "abouts".* FROM "abouts" WHERE "abouts"."id" = $1 LIMIT 1  [["id", 5]]