app/controllers/application_controller.rb

  def index
  	@factbox = Factbox.all.order("id ASC")
---
SELECT "factboxes".* FROM "factboxes"  ORDER BY id DESC

  def update_factbox
    respond_to do |format|
      if @factbox.update(factbox_params)
---
UPDATE "factboxes" SET "description" = $1, "updated_at" = $2 WHERE "factboxes"."id" = $3  [["description", "The average U.S. resident uses about 100 gallons per day, where Europeans use only 50 gallons per day on average."], ["updated_at", "2015-12-02 21:39:00.578530"], ["id", 2]]

    def set_factbox
      @factbox = Factbox.find(params[:id])
---
SELECT  "factboxes".* FROM "factboxes" WHERE "factboxes"."id" = $1 LIMIT 1  [["id", nil]]