app/controllers/credits_controller.rb

SELECT "credits".* FROM "credits"
---
  def index
    @credits = Credit.all

UPDATE "credits" SET "image_updated_at" = $1, "image_file_name" = $2, "updated_at" = $3 WHERE "credits"."id" = $4  [["image_updated_at", "2015-10-24 20:31:00.322670"], ["image_file_name", "214x140.png"], ["updated_at", "2015-10-24 20:31:00.339430"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @credit.update(credit_params)

SELECT  "credits".* FROM "credits" WHERE "credits"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_credit
      @credit = Credit.find(params[:id])